{
  "aor": 0.005709326923076922,
  "aqi": 0.014081083461538461,
  "bids_meta": {
    "AccelNumReferenceLines": 24,
    "AccelerationFactorPE": 2,
    "AcquisitionMatrix": "64/0/0/64",
    "CogAtlasID": "tsk_4a57abb949e8a",
    "CogPOID": "COGPO_00107",
    "DeviceSerialNumber": "35426",
    "EPIFactor": 128,
    "EchoTime": 0.03,
    "EchoTrainLength": 1,
    "EffectiveEchoSpacing": 0.000395,
    "FlipAngle": 90,
    "ImageType": "ORIGINAL/PRIMARY/M/ND/MOSAIC",
    "ImagingFrequency": 123191767,
    "InPlanePhaseEncodingDirection": "COL",
    "Instructions": "Demo Instructions: This is a demo of the task in which you will learn to press the LEFT (blue) button or the RIGHT (yellow) button in response to color and shapes. The colors will be red or green. The shapes will be circles or triangles. Each trial starts with a cue indicating whether you should respond to color or shape. Try to respond as fast and as accurately as you can for each trial. If the cue is \"COLOR\" or \"C\" respond to the color. Press the LEFT button if the color is RED. Press the RIGHT button if the color is GREEN. If the cue is \"SHAPE\" or \"S\" respond to the shape. Press the LEFT button if the shape is a TRIANGLE. Press the RIGHT button if the shape is a CIRCLE. So, again, if the cue is \"COLOR\" or \"C\": Press the LEFT button if the color is RED. Press the RIGHT button if the color is GREEN. If the cue is \"SHAPE\" or \"S\": Press the LEFT button if the shape is a TRIANGLE. Press the RIGHT button if the shape is a CIRCLE.\nScan Instructions: This task is the one where you have to respond to the color or the shape of images we show you on the screen as fast and as accurately as possible. At the top, you’ll see a cue that tells you what to respond to. If the cue says \"COLOR\" or \"C,\" you should respond to the color, and if it says \"SHAPE\" or \"S\" you should respond to the shape. When it says to respond to color, press the first button if it’s red, and the second button if it’s green. When it says to respond to shape, push the first button if it’s a triangle, and the second button if it’s a circle. Again, that’s red for button 1 and green for button 2, and triangle for button 1 and circle for button 2. Any questions?",
    "MRAcquisitionType": "2D",
    "MagneticFieldStrength": 3,
    "ManufacturerModelName": "TrioTim",
    "NumberOfAverages": 1,
    "NumberOfPhaseEncodingSteps": 63,
    "PatientPosition": "HFS",
    "PercentPhaseFieldOfView": 100,
    "PercentSampling": 100,
    "PhaseEncodingDirection": "j-",
    "PixelBandwidth": 1420,
    "ProtocolName": "BOLD - TASKSWITCH",
    "ReceiveCoilName": "HeadMatrix",
    "RepetitionTime": 2,
    "ScanOptions": "FS",
    "ScanningSequence": "EP",
    "SequenceName": "*epfid2d1_64",
    "SequenceVariant": "SK",
    "SliceTiming": [
      1.0025,
      0,
      1.0625,
      0.0575,
      1.12,
      0.1175,
      1.18,
      0.1775,
      1.24,
      0.235,
      1.2975,
      0.295,
      1.3575,
      0.3525,
      1.4175,
      0.4125,
      1.475,
      0.4725,
      1.535,
      0.53,
      1.5925,
      0.59,
      1.6525,
      0.6475,
      1.7125,
      0.7075,
      1.77,
      0.7675,
      1.83,
      0.825,
      1.8875,
      0.885,
      1.9475,
      0.945
    ],
    "SoftwareVersions": "syngo MR B17",
    "TaskDescription": "In the Task-Switching (TS) task, participants were presented with a series of one of four possible stimuli and asked to respond to the stimulus based on the task cue presented prior to, and above, the image. The four stimuli included a red triangle, red circle, green triangle, and green circle. Participants switched between responding to the image's color (i.e., red or green) or the shape (i.e., triangle or circle). Cues presented included either \"SHAPE\" or \"S\" on trials where participants were expected to respond to the shape of the stimulus; cues presented included either \"COLOR\" or \"C\" on trials where participants were expected to respond to the color of the stimulus. On 33% of trials the instructions switched, such that participants were instructed to switch from responding from shape to color, or vice versa. On 67% of trials, the instructions remained the same but the cues changes. This task is designed to measure the changes in reaction time between trials requiring vs. not requiring a switch in responding. Participants completed a total of 96 trials, for a total run time of 6 min 52 s. For the practice run, participants completed 10 trials of the task. Before reading task instructions, experimenters would mention to participants that this task is difficulty for people, and that a lot of time people need to redo the demo more than once in order to get comfortable with the task, in order to reduce frustration on behalf of the participants. As the button order was counterbalanced across participants, instructions below represent one such button order (and were switched for other participants).",
    "TaskFullName": "Task Switching",
    "TaskName": "taskswitch",
    "TaskParameters": {
      "button_set": 2,
      "left_color": "red",
      "left_shape": "circle",
      "right_color": "green",
      "right_shape": "triangle",
      "trigger_time": 8.2989
    },
    "TotalScanTimeSec": 424,
    "TransmitCoilName": "Body",
    "VariableFlipAngleFlag": "N",
    "dataset": "ds000030",
    "modality": "bold",
    "subject_id": "60078",
    "task_id": "taskswitch"
  },
  "dummy_trs": 0,
  "dvars_nstd": 40.139950507826065,
  "dvars_std": 1.1920971500483095,
  "dvars_vstd": 1.0360934422222225,
  "efc": 0.5601813356084346,
  "fber": 1039.849609375,
  "fd_mean": 0.4047563233232499,
  "fd_num": 177,
  "fd_perc": 85.09615384615384,
  "fwhm_avg": 2.097834166666667,
  "fwhm_x": 2.0676133333333335,
  "fwhm_y": 2.313966666666667,
  "fwhm_z": 1.9119225,
  "gcor": 0.0311224,
  "gsr_x": 0.0001455757737858221,
  "gsr_y": 0.03490980714559555,
  "provenance": {
    "md5sum": "b0a52791073029e4c65adf3ff90907a0",
    "settings": {
      "fd_thres": 0.2,
      "testing": false
    },
    "software": "mriqc",
    "version": "21.0.0rc2",
    "webapi_port": null,
    "webapi_url": "https://mriqc.nimh.nih.gov/api/v1"
  },
  "size_t": 208,
  "size_x": 64,
  "size_y": 64,
  "size_z": 34,
  "snr": 5.435683595425798,
  "spacing_tr": 2.0,
  "spacing_x": 3.0,
  "spacing_y": 3.0,
  "spacing_z": 4.0,
  "summary_bg_k": 17.951219112980063,
  "summary_bg_mad": 13.222247051925317,
  "summary_bg_mean": 53.615665435791016,
  "summary_bg_median": 22.88461685180664,
  "summary_bg_n": 78713.0,
  "summary_bg_p05": 12.884615898132324,
  "summary_bg_p95": 213.9346221923825,
  "summary_bg_stdv": 80.88029479980469,
  "summary_fg_k": 1.4105389957396852,
  "summary_fg_mad": 122.85645179393586,
  "summary_fg_mean": 778.5579223632812,
  "summary_fg_median": 775.331787109375,
  "summary_fg_n": 27367.0,
  "summary_fg_p05": 547.3500305175781,
  "summary_fg_p95": 1013.7476257324219,
  "summary_fg_stdv": 142.63479614257812,
  "tsnr": 38.642547865747474
}